docments/org/docker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>docker</title>
<!-- 2016-02-23 Tue 18:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="CarlJohn" />
<link rel="stylesheet" type="text/css"
    href="/Users/cj/.emacs.d/org/css/htmlize.css"/>

<link rel="stylesheet" type="text/css"
    href="/Users/cj/.emacs.d/org/css/bigblow.css"/>

<link rel="stylesheet" type="text/css"
    href="/Users/cj/.emacs.d/org/css/hideshow.css"/>










</head>
<body>
<div id="content">
<h1 class="title">docker</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The Docker user guide</a>
<ul>
<li><a href="#sec-1-1">1.1. 目的</a></li>
<li><a href="#sec-1-2">1.2. Docker Hub</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 地址</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Docker 应用"Hello world"</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. 在容器中输出hello world</a></li>
<li><a href="#sec-1-3-2">1.3.2. 交互式的容器</a></li>
<li><a href="#sec-1-3-3">1.3.3. 容器成为守护进程</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Docker 运行实例</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. 启动一个实例</a></li>
<li><a href="#sec-1-4-2">1.4.2. 查看状态</a></li>
<li><a href="#sec-1-4-3">1.4.3. 监听在其他端口</a></li>
<li><a href="#sec-1-4-4">1.4.4. 查看网络端口快捷方式</a></li>
<li><a href="#sec-1-4-5">1.4.5. 查看WEB应用日志</a></li>
<li><a href="#sec-1-4-6">1.4.6. 查看WEB应用的进程</a></li>
<li><a href="#sec-1-4-7">1.4.7. 查看docker容器的配置和状态信息</a></li>
<li><a href="#sec-1-4-8">1.4.8. 重启WEB应用容器</a></li>
<li><a href="#sec-1-4-9">1.4.9. 删除容器</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Docker 镜像</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. 公共镜像</a></li>
<li><a href="#sec-1-5-2">1.5.2. 自定义镜像</a></li>
<li><a href="#sec-1-5-3">1.5.3. 镜像标签(tag)</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6. Docker 连接容器</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1. 端口映射</a></li>
<li><a href="#sec-1-6-2">1.6.2. 容器连接</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. 原理（实现方式）</a>
<ul>
<li><a href="#sec-2-1">2.1. 目的</a></li>
<li><a href="#sec-2-2">2.2. namespace</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. 资源隔离标志位(20多种CLONE<sub>*</sub>)</a></li>
<li><a href="#sec-2-2-2">2.2.2. /proc/[pid]/ns 目录</a></li>
<li><a href="#sec-2-2-3">2.2.3. namespace的四种API</a></li>
<li><a href="#sec-2-2-4">2.2.4. UTS(UNIX Time-sharing System) namespace</a></li>
<li><a href="#sec-2-2-5">2.2.5. IPC(Inter-Process Communication) namespace</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Docker 常用选项</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The Docker user guide</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 目的</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>docker中运行你的应用程序
</li>
<li>运行你自己的容器
</li>
<li>创建docker镜像
</li>
<li>分享docker镜像
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Docker Hub</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 地址</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<a href="https://hub.docker.com/">https://hub.docker.com/</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Docker 应用"Hello world"</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 在容器中输出hello world</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-shell">sudo docker run centos:6 echo 'hello world'
hello world
</pre>
</div>
<ol class="org-ol">
<li>命令解释
</li>
<li>docker run 组合会运行容器
</li>
<li>centos:6 指定镜像版本（如果本地没有找到镜像，则从docker.com查找
</li>
<li>容器中执行的命令
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> 交互式的容器</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-shell">sudo docker run -t -i centos:6 /bin/bash
root@af8bae53bdd3:/#
</pre>
</div>
<ol class="org-ol">
<li>选项解释：

<p>
-t 表示在新容器内指定一个伪终端或终端
</p>

<p>
-i 表示允许对容器内的(STDIN)进行交互
</p>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> 容器成为守护进程</h4>
<div class="outline-text-4" id="text-1-3-3">
<ol class="org-ol">
<li>启动进程
<div class="org-src-container">

<pre class="src src-shell">sudo docker run -d centos:6 bash -c "while true; do echo hello world; done"
1e5535038e285177d5214659a068137486f96ee5c2e85a4ac52dc83f2ebe4147(容器ID（Container ID)
</pre>
</div>
</li>
<li>容器进程查看
<div class="org-src-container">

<pre class="src src-shell">sudo docker ps
CONTAINER ID  IMAGE         COMMAND            CREATED       STATUS     PORTS   NAMES
7d045853d31b centos:6 "bash -c 'while true;" 7 minutes ago  Up 7 minutes    furious_wozniak
</pre>
</div>
</li>
<li>查看容器内应用的输出
<div class="org-src-container">

<pre class="src src-shell">sudo docker logs furious_wozniak
</pre>
</div>
</li>
<li>关闭容器
<div class="org-src-container">

<pre class="src src-shell">sudo docker stop furious_wozniak
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Docker 运行实例</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 启动一个实例</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">

<pre class="src src-shell">sudo docker run -d -P training/webapp python app.py
</pre>
</div>
<p>
-P 选项通知 Docker 将容器内部使用的网络端口映射到我们使用的主机上
</p>

<p>
本例中指定了training/web 镜像。这个镜像已经包含了简单的Flask web 应用
</p>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> 查看状态</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker ps -l
# 多出一个 0.0.0.0:32768-&gt;5000/tcp
# 5000端口是镜像预定义的端口
# 可以在构建容器时指定默认端口
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> 监听在其他端口</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class="org-src-container">

<pre class="src src-shell">sudo docker run -d -p 5000:5000 training/webapp python app.py
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> 查看网络端口快捷方式</h4>
<div class="outline-text-4" id="text-1-4-4">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker port xxxxxxxxxx 5000
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> 查看WEB应用日志</h4>
<div class="outline-text-4" id="text-1-4-5">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker logs -f nostalgic_morse
* Running on http://0.0.0.0:5000/
10.0.2.2 - - [23/May/2014 20:16:31] "GET / HTTP/1.1" 200 -
10.0.2.2 - - [23/May/2014 20:16:31] "GET /favicon.ico HTTP/1.1" 404 -
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6"><span class="section-number-4">1.4.6</span> 查看WEB应用的进程</h4>
<div class="outline-text-4" id="text-1-4-6">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker top xxxxxx_xxx
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-7" class="outline-4">
<h4 id="sec-1-4-7"><span class="section-number-4">1.4.7</span> 查看docker容器的配置和状态信息</h4>
<div class="outline-text-4" id="text-1-4-7">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker inspect xxxxxxx_xxx
</pre>
</div>

<div class="org-src-container">

<pre class="src src-shell">sudo docker inspect -f '{{ .NetworkSettings.IPAddress }}' nostalgic_morse
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-8" class="outline-4">
<h4 id="sec-1-4-8"><span class="section-number-4">1.4.8</span> 重启WEB应用容器</h4>
<div class="outline-text-4" id="text-1-4-8">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker restart xxxxxx_xxx
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4-9" class="outline-4">
<h4 id="sec-1-4-9"><span class="section-number-4">1.4.9</span> 删除容器</h4>
<div class="outline-text-4" id="text-1-4-9">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker rm xxxxxx_xxxx
</pre>
</div>

<p>
注意：不能删除正在运行中的容器，必须先stop
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Docker 镜像</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> 公共镜像</h4>
<div class="outline-text-4" id="text-1-5-1">
</div><ol class="org-ol"><li><a id="sec-1-5-1-0-1" name="sec-1-5-1-0-1"></a>在主机上列出镜像列表<br  /><div class="outline-text-6" id="text-1-5-1-0-1">
<p>
列出本地可以使用的镜像
</p>
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker images
</pre>
</div>
</div>
</li>
<li><a id="sec-1-5-1-0-2" name="sec-1-5-1-0-2"></a>获取一个新的镜像<br  /><div class="outline-text-6" id="text-1-5-1-0-2">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker pull centos
</pre>
</div>
</div>
</li>
<li><a id="sec-1-5-1-0-3" name="sec-1-5-1-0-3"></a>搜索镜像<br  /><div class="outline-text-6" id="text-1-5-1-0-3">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker search centos
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> 自定义镜像</h4>
<div class="outline-text-4" id="text-1-5-2">
</div><ol class="org-ol"><li><a id="sec-1-5-2-0-1" name="sec-1-5-2-0-1"></a>更新并且提交更改<br  /><div class="outline-text-6" id="text-1-5-2-0-1">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker run -t -i training/sinatra /bin/bash
root@0b2616b0e5a8:/#
注意：已创建容器ID 0b2616b0e5a8，需要指定这个ID来提交新的更改
</pre>
</div>

<p>
修改之后提交
</p>

<div class="org-src-container">

<pre class="src src-shell">$ sudo docker commit -m="Added json gem" -a="Kate Smith" 0b2616b0e5a8 ouruser/sinatra:v2
4f177bd27a9ff0f6dc2a830403925b5360bfe0b93d476f7fc3231110e7f71b1c
</pre>
</div>

<p>
-m 参数来指定提交信息
</p>

<p>
-a 参数来指定提交人
</p>
</div>
</li>
<li><a id="sec-1-5-2-0-2" name="sec-1-5-2-0-2"></a>使用 Dockerfile 构建镜像<br  /><div class="outline-text-6" id="text-1-5-2-0-2">
<ol class="org-ol">
<li>准备路径
<div class="org-src-container">

<pre class="src src-shell">$ cd /tmp
$ mkdir sinatra
$ cd sinatra
$ touch Dockerfile
</pre>
</div>
</li>
<li>编写配置

<p>
在Dockerfile添加如下内容
</p>
<div class="org-src-container">

<pre class="src src-conf"># This is a comment
FROM fedora
MAINTAINER CJ &lt;zhangyafeng097@emao.com&gt;
RUN dnf install emacs -y
</pre>
</div>
</li>
<li>执行打包（构建）
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker build -t lala/sinatra:v5 /tmp/sinatra
</pre>
</div>
</li>

<li>注意

<p>
<i><b>与存储程序驱动无关，镜像不能超过127层。这是一种全局设置，为了是从整体上来优化镜像的大小。</b></i>
</p>
</li>

<li>Dockerfile资料
<a href="https://docs.docker.com/userguide/level1/">https://docs.docker.com/userguide/level1/</a>
</li>
</ol>
</div>
</li></ol>
</div>
