docments/org/docker.org
***** 添加标签
     #+BEGIN_SRC shell
       $ docker tag 5db5f8471261 ouruser/sinatra:devel
       docker tag 需要使用镜像ID，这里是 5db5f8471261，用户名、镜像源和新的标签名。
     #+END_SRC
***** 查看某镜像的标签
     #+BEGIN_SRC shell
       $ docker images ouruser/sinatra
       REPOSITORY          TAG     IMAGE ID      CREATED        VIRTUAL SIZE
       ouruser/sinatra     latest  5db5f8471261  11 hours ago   446.7 MB
       ouruser/sinatra     devel   5db5f8471261  11 hours ago   446.7 MB
       ouruser/sinatra     v2      5db5f8471261  11 hours ago   446.7 MB
     #+END_SRC
** Docker 连接容器
*** 端口映射
    1. 指定udp映射
       #+BEGIN_SRC shell
	 $ sudo docker run -d -p 127.0.0.1:5000:5000/udp training/webapp python app.py
       #+END_SRC
*** 容器连接
***** 概念
     端口映射并不是唯一把docker连接到另一个容器的方法。docker有一个连接系统允许将多个容器连接在一起，
     共享连接信息。docker连接会创建一个父子关系，其中父容器可以看到子容器的信息。
***** 容器命名
     #+BEGIN_SRC shell
       $ sudo docker run -d -P --name web training/webapp python app.py
     #+END_SRC
***** 获取容器名字
     #+BEGIN_SRC shell
       $ sudo docker inspect -f "{{ .Name }}" aed84ee21bde
       /web
     #+END_SRC
***** 容器连接
     连接允许容器之间可见并且安全地进行通信。使用--link创建连接。我们创建一个新容器，这个容器是数据库。
     1. 创建一个db容器
	#+BEGIN_SRC shell
	  $ sudo docker run -d --name db training/postgres
	#+END_SRC
     2. 创建一个web容器连接db容器
	#+BEGIN_SRC shell
	  $ sudo docker run -d -P --name web --link db:db training/webapp python app.py
	  # --link name:alias
	#+END_SRC

* 原理（实现方式）
** 目的
   了解docker的实现机制会有助于用更合适的方式来使用docker
** namespace
*** 资源隔离标志位(20多种CLONE_*)
    | namespace | 系统调用参数  | 隔离内容                   |
    |-----------+---------------+----------------------------|
    | UTS       | CLONE_NEWUTS  | 主机名与域名               |
    | IPC       | CLONE_NEWIPC  | 信号量、消息队列和共享内存 |
    | PID       | CLONE_NEWPID  | 进程编号                   |
    | Network   | CLONE_NEWNET  | 网络设备、网络栈、端口     |
    | Mount     | CLONE_NEWNS   | 挂载点                     |
    | User      | CLONE_NEWUSER | 用户和用户组                     |
*** /proc/[pid]/ns 目录
    从3.8内核开始，可以在该目录下看到指向不同namespace号的文件如：
    #+BEGIN_SRC shell
      [cj @ office 12:39 ~]$ ls -l /proc/$$/ns
      总用量 0
      lrwxrwxrwx 1 cj cj 0 2月  23 12:39 ipc -> ipc:[4026531839]
      lrwxrwxrwx 1 cj cj 0 2月  23 12:39 mnt -> mnt:[4026531840]
      lrwxrwxrwx 1 cj cj 0 2月  23 12:39 net -> net:[4026531957]
      lrwxrwxrwx 1 cj cj 0 2月  23 12:39 pid -> pid:[4026531836]
      lrwxrwxrwx 1 cj cj 0 2月  23 12:39 user -> user:[4026531837]
      lrwxrwxrwx 1 cj cj 0 2月  23 12:39 uts -> uts:[4026531838]
    #+END_SRC
*** namespace的四种API
**** clone()
    1. 通过clone()在创建新进程的同时创建namespace
       #+BEGIN_SRC c
	 int clone(int (*child_func)(void *), void *child_stack, int flags, void *arg);
	 // child_func 传入子进程运行的程序主函数
	 // child_stack 传入子进程使用的栈空间
	 // flags 表示使用哪些CLONE_*标志位，与namespace相关的已列在上表中
	 // args 用于传入用户参数
       #+END_SRC
**** setns() 加入一个已经存在的namespace
    在 Docker 中，使用 docker exec 在已经运行着的容器中执行一个新的命令，就需要用到该方法。
    #+BEGIN_SRC C
      int setns(int fd, int nstype);
      // 参数 fd 表示要加入 namespace 的文件描述符。它是一个指向 /proc/[pid]/ns 目录的文件喵舒服。
      // 参数 nstype 让调用者可以检查mespace类型是否符合实际要求。参数为 0 时 不检查。
    #+END_SRC

    示例：
    #+BEGIN_SRC shell
      touch ~/uts
      mount --bind /proc/27514/ns/utf ~/uts
    #+END_SRC
    #+BEGIN_SRC c
      fd = open(argv[1], O_RDONLY);
      setns(fd, 0);
      execvp(argv[2], &argv[2]);
    #+END_SRC

**** unshare()
    同 clone()，但运行在原先的进程上，不需要启动一个新进程。(在Docker中并没有使用这个接口）
    #+BEGIN_SRC c
      int unshare(int flags);
    #+END_SRC

**** fork()
    就这么点事儿，fork后看返回值来确定自己是否是子进程，然后做不同的操作 - -|||

*** UTS(UNIX Time-sharing System) namespace
    提供了主机名和域名的隔离，这样才能在网络上被当作一个独立的节点，而非宿主机上的一个进程。
    在Docker中，每个镜像基本都以自身提供的服务名称来命名镜像的hostname，且不会对宿主机产生任何影响，原理就是利用UTS namespace
    #+BEGIN_SRC c
      #define _GNU_SOURCE
      #include <sys/types.h>
      #include <sys/wait.h>
      #include <stdio.h>
      #include <sched.h>
      #include <signal.h>
      #include <unistd.h>

      #define STACK_SIZE (1024 * 1024)

      static char child_stack[STACK_SIZE];
      char * const child_args[] = {
	      "/bin/bash",
	      NULL,
      };

      int child_main(void *args)
      {
	      printf("在子进程中!\n");
	      sethostname("NewNamespace", 12);
	      execv(child_args[0], child_args);
	      return 1;
      }

      int main()
      {
	      printf("程序开始：\n");
	      int child_pid = clone(child_main, child_stack + STACK_SIZE, CLONE_NEWUTS | SIGCHLD, NULL);
	      if (0 > child_pid)
		      perror("不知到为什么错了");
	      waitpid(child_pid, NULL, 0);
	      puts("已退出");
	      return 0;
      }
    #+END_SRC

*** IPC(Inter-Process Communication) namespace
    进程间通信涉及的IPC资源包括常见的信号量、消息队列和共享内存。
