docments/org/docker.html
<div id="outline-container-sec-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> 镜像标签(tag)</h4>
<div class="outline-text-4" id="text-1-5-3">
</div><ol class="org-ol"><li><a id="sec-1-5-3-0-1" name="sec-1-5-3-0-1"></a>添加标签<br  /><div class="outline-text-6" id="text-1-5-3-0-1">
<div class="org-src-container">

<pre class="src src-shell">$ docker tag 5db5f8471261 ouruser/sinatra:devel
docker tag 需要使用镜像ID，这里是 5db5f8471261，用户名、镜像源和新的标签名。
</pre>
</div>
</div>
</li>
<li><a id="sec-1-5-3-0-2" name="sec-1-5-3-0-2"></a>查看某镜像的标签<br  /><div class="outline-text-6" id="text-1-5-3-0-2">
<div class="org-src-container">

<pre class="src src-shell">$ docker images ouruser/sinatra
REPOSITORY          TAG     IMAGE ID      CREATED        VIRTUAL SIZE
ouruser/sinatra     latest  5db5f8471261  11 hours ago   446.7 MB
ouruser/sinatra     devel   5db5f8471261  11 hours ago   446.7 MB
ouruser/sinatra     v2      5db5f8471261  11 hours ago   446.7 MB
</pre>
</div>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Docker 连接容器</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> 端口映射</h4>
<div class="outline-text-4" id="text-1-6-1">
<ol class="org-ol">
<li>指定udp映射
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker run -d -p 127.0.0.1:5000:5000/udp training/webapp python app.py
</pre>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> 容器连接</h4>
<div class="outline-text-4" id="text-1-6-2">
</div><ol class="org-ol"><li><a id="sec-1-6-2-0-1" name="sec-1-6-2-0-1"></a>概念<br  /><div class="outline-text-6" id="text-1-6-2-0-1">
<p>
端口映射并不是唯一把docker连接到另一个容器的方法。docker有一个连接系统允许将多个容器连接在一起，
共享连接信息。docker连接会创建一个父子关系，其中父容器可以看到子容器的信息。
</p>
</div>
</li>
<li><a id="sec-1-6-2-0-2" name="sec-1-6-2-0-2"></a>容器命名<br  /><div class="outline-text-6" id="text-1-6-2-0-2">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker run -d -P --name web training/webapp python app.py
</pre>
</div>
</div>
</li>
<li><a id="sec-1-6-2-0-3" name="sec-1-6-2-0-3"></a>获取容器名字<br  /><div class="outline-text-6" id="text-1-6-2-0-3">
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker inspect -f "{{ .Name }}" aed84ee21bde
/web
</pre>
</div>
</div>
</li>
<li><a id="sec-1-6-2-0-4" name="sec-1-6-2-0-4"></a>容器连接<br  /><div class="outline-text-6" id="text-1-6-2-0-4">
<p>
连接允许容器之间可见并且安全地进行通信。使用&#x2013;link创建连接。我们创建一个新容器，这个容器是数据库。
</p>
<ol class="org-ol">
<li>创建一个db容器
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker run -d --name db training/postgres
</pre>
</div>
</li>
<li>创建一个web容器连接db容器
<div class="org-src-container">

<pre class="src src-shell">$ sudo docker run -d -P --name web --link db:db training/webapp python app.py
# --link name:alias
</pre>
</div>
</li>
</ol>
</div>
</li></ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 原理（实现方式）</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 目的</h3>
<div class="outline-text-3" id="text-2-1">
<p>
了解docker的实现机制会有助于用更合适的方式来使用docker
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> namespace</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> 资源隔离标志位(20多种CLONE<sub>*</sub>)</h4>
<div class="outline-text-4" id="text-2-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">namespace</th>
<th scope="col" class="left">系统调用参数</th>
<th scope="col" class="left">隔离内容</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">UTS</td>
<td class="left">CLONE<sub>NEWUTS</sub></td>
<td class="left">主机名与域名</td>
</tr>

<tr>
<td class="left">IPC</td>
<td class="left">CLONE<sub>NEWIPC</sub></td>
<td class="left">信号量、消息队列和共享内存</td>
</tr>

<tr>
<td class="left">PID</td>
<td class="left">CLONE<sub>NEWPID</sub></td>
<td class="left">进程编号</td>
</tr>

<tr>
<td class="left">Network</td>
<td class="left">CLONE<sub>NEWNET</sub></td>
<td class="left">网络设备、网络栈、端口</td>
</tr>

<tr>
<td class="left">Mount</td>
<td class="left">CLONE<sub>NEWNS</sub></td>
<td class="left">挂载点</td>
</tr>

<tr>
<td class="left">User</td>
<td class="left">CLONE<sub>NEWUSER</sub></td>
<td class="left">用户和用户组</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> /proc/[pid]/ns 目录</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
从3.8内核开始，可以在该目录下看到指向不同namespace号的文件如：
</p>
<div class="org-src-container">

<pre class="src src-shell">[cj @ office 12:39 ~]$ ls -l /proc/$$/ns
总用量 0
lrwxrwxrwx 1 cj cj 0 2月  23 12:39 ipc -&gt; ipc:[4026531839]
lrwxrwxrwx 1 cj cj 0 2月  23 12:39 mnt -&gt; mnt:[4026531840]
lrwxrwxrwx 1 cj cj 0 2月  23 12:39 net -&gt; net:[4026531957]
lrwxrwxrwx 1 cj cj 0 2月  23 12:39 pid -&gt; pid:[4026531836]
lrwxrwxrwx 1 cj cj 0 2月  23 12:39 user -&gt; user:[4026531837]
lrwxrwxrwx 1 cj cj 0 2月  23 12:39 uts -&gt; uts:[4026531838]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> namespace的四种API</h4>
<div class="outline-text-4" id="text-2-2-3">
</div><ol class="org-ol"><li><a id="sec-2-2-3-1" name="sec-2-2-3-1"></a>clone()<br  /><div class="outline-text-5" id="text-2-2-3-1">
<ol class="org-ol">
<li>通过clone()在创建新进程的同时创建namespace
<div class="org-src-container">

<pre class="src src-c">int clone(int (*child_func)(void *), void *child_stack, int flags, void *arg);
// child_func 传入子进程运行的程序主函数
// child_stack 传入子进程使用的栈空间
// flags 表示使用哪些CLONE_*标志位，与namespace相关的已列在上表中
// args 用于传入用户参数
</pre>
</div>
</li>
</ol>
</div>
</li>
<li><a id="sec-2-2-3-2" name="sec-2-2-3-2"></a>setns() 加入一个已经存在的namespace<br  /><div class="outline-text-5" id="text-2-2-3-2">
<p>
在 Docker 中，使用 docker exec 在已经运行着的容器中执行一个新的命令，就需要用到该方法。
</p>
<div class="org-src-container">

<pre class="src src-C">int setns(int fd, int nstype);
// 参数 fd 表示要加入 namespace 的文件描述符。它是一个指向 /proc/[pid]/ns 目录的文件喵舒服。
// 参数 nstype 让调用者可以检查mespace类型是否符合实际要求。参数为 0 时 不检查。
</pre>
</div>

<p>
示例：
</p>
<div class="org-src-container">

<pre class="src src-shell">touch ~/uts
mount --bind /proc/27514/ns/utf ~/uts
</pre>
</div>
<div class="org-src-container">

<pre class="src src-c">fd = open(argv[1], O_RDONLY);
setns(fd, 0);
execvp(argv[2], &amp;argv[2]);
</pre>
</div>
</div>
</li>

<li><a id="sec-2-2-3-3" name="sec-2-2-3-3"></a>unshare()<br  /><div class="outline-text-5" id="text-2-2-3-3">
<p>
同 clone()，但运行在原先的进程上，不需要启动一个新进程。(在Docker中并没有使用这个接口）
</p>
<div class="org-src-container">

<pre class="src src-c">int unshare(int flags);
</pre>
</div>
</div>
</li>

<li><a id="sec-2-2-3-4" name="sec-2-2-3-4"></a>fork()<br  /><div class="outline-text-5" id="text-2-2-3-4">
<p>
就这么点事儿，fork后看返回值来确定自己是否是子进程，然后做不同的操作 - -|||
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> UTS(UNIX Time-sharing System) namespace</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
提供了主机名和域名的隔离，这样才能在网络上被当作一个独立的节点，而非宿主机上的一个进程。
在Docker中，每个镜像基本都以自身提供的服务名称来命名镜像的hostname，且不会对宿主机产生任何影响，原理就是利用UTS namespace
</p>
<div class="org-src-container">

<pre class="src src-c">#define _GNU_SOURCE
#include &lt;sys/types.h&gt;
#include &lt;sys/wait.h&gt;
#include &lt;stdio.h&gt;
#include &lt;sched.h&gt;
#include &lt;signal.h&gt;
#include &lt;unistd.h&gt;

#define STACK_SIZE (1024 * 1024)

static char child_stack[STACK_SIZE];
char * const child_args[] = {
	"/bin/bash",
	NULL,
};

int child_main(void *args)
{
	printf("在子进程中!\n");
	sethostname("NewNamespace", 12);
	execv(child_args[0], child_args);
	return 1;
}

int main()
{
	printf("程序开始：\n");
	int child_pid = clone(child_main, child_stack + STACK_SIZE, CLONE_NEWUTS | SIGCHLD, NULL);
	if (0 &gt; child_pid)
		perror("不知到为什么错了");
	waitpid(child_pid, NULL, 0);
	puts("已退出");
	return 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> IPC(Inter-Process Communication) namespace</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
进程间通信涉及的IPC资源包括常见的信号量、消息队列和共享内存。
</p>
</div>
</div>
</div>
</div>
